# Git - система контроля версий
# VCS - Version Control System позволяет нам вернуться к ранней версии, посмотреть кто когда сделал изменения.
# Контроль версий - отслеживание изменений программного кода
# Дома создать аккаунт на гитхаб и программу Git
# Зайти в эту программу можно создав папку с проектом и кликнув по ней правой кнопкой в выпадающем меню выбрать Open Git Bash
# В появившемся окне сделать:
# 1. git config --global user.name 'Ваше имя'
# enter
# 2. git config --global user.email почта@mail.ru
# enter
# 3. git config --list
# enter
# Если в конце выпали наши данные, то все правильно
print('Мой репозиторий')
# git init - пишется один раз вначале работы
# git add. - сохранить изменения
# commit - сохраняются изменения с добавлением названия
# git remote add origin https://github.com/ilana-maratovna/website - подключение репозитория с сайта гитхаб
# git branch -M main - выбор ветки на которую будет сохраняться проект
# Ветка - версия проекта(черновик или основная). На черновик сохраняется любая проделанная работа. На основную ветку - рабочий код.
